In [1]:
##pt자료 28~31
##파이썬에서 엑셀에서 사용하는 자료를 처리하는 데이터베이스는
##pandas로 작업합니다.
## pandas는 2일동안 자세히 학습하니 꼭 이해하시기 바랍니다.
!pip install pandas
import pandas as pd

Requirement already satisfied: pandas in c:\programdata\anaconda3\lib\site-packages (0.24.2)
Requirement already satisfied: pytz>=2011k in c:\programdata\anaconda3\lib\site-packages (from pandas) (2019.1)
Requirement already satisfied: numpy>=1.12.0 in c:\programdata\anaconda3\lib\site-packages (from pandas) (1.16.4)
Requirement already satisfied: python-dateutil>=2.5.0 in c:\programdata\anaconda3\lib\site-packages (from pandas) (2.8.0)
Requirement already satisfied: six>=1.5 in c:\users\hsy\appdata\roaming\python\python37\site-packages (from python-dateutil>=2.5.0->pandas) (1.12.0)

In [2]:
#sample.csv의 데이터에 한글이 있을때는 글자 깨짐 현상이 발생할수 있음
#'파이썬 인코딩'으로 구글링 검색하면 다양한 경우의 수가 나옴
df=pd.read_csv("D:\인재개발원 파이썬 강좌\[자가실습형파이썬기본]20200409_강의자료\python_data\sample.csv",encoding="euc-kr")

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
bun     5 non-null int64
name    5 non-null object
kor     5 non-null int64
eng     5 non-null int64
bigo    1 non-null object
dtypes: int64(3), object(2)
memory usage: 280.0+ bytes

In [4]:
df.columns[0]

'bun'

In [5]:
df

   bun name  kor  eng bigo
0    1    a    1    2  NaN
1    2    b    2    3  재시험
2    3    c    2    3  NaN
3    4    d    3    2  NaN
4    5    e    4   20  NaN

In [6]:
df.sort_values(by="kor")

   bun name  kor  eng bigo
0    1    a    1    2  NaN
1    2    b    2    3  재시험
2    3    c    2    3  NaN
3    4    d    3    2  NaN
4    5    e    4   20  NaN

In [7]:
df.sort_values(by="kor", ascending=False)

   bun name  kor  eng bigo
4    5    e    4   20  NaN
3    4    d    3    2  NaN
1    2    b    2    3  재시험
2    3    c    2    3  NaN
0    1    a    1    2  NaN

In [8]:
df.describe()

            bun       kor        eng
count  5.000000  5.000000   5.000000
mean   3.000000  2.400000   6.000000
std    1.581139  1.140175   7.842194
min    1.000000  1.000000   2.000000
25%    2.000000  2.000000   2.000000
50%    3.000000  2.000000   3.000000
75%    4.000000  3.000000   3.000000
max    5.000000  4.000000  20.000000

In [9]:
df.corr()

          bun       kor       eng
bun  1.000000  0.970725  0.705668
kor  0.970725  1.000000  0.782868
eng  0.705668  0.782868  1.000000

In [10]:
df.sort_values(by="eng")

   bun name  kor  eng bigo
0    1    a    1    2  NaN
3    4    d    3    2  NaN
1    2    b    2    3  재시험
2    3    c    2    3  NaN
4    5    e    4   20  NaN

In [14]:
df.sort_values(by="eng", ascending=False)

   bun name  kor  eng bigo
4    5    e    4   20  NaN
1    2    b    2    3  재시험
2    3    c    2    3  NaN
0    1    a    1    2  NaN
3    4    d    3    2  NaN

In [13]:
value_select=df.columns[2]
df.sort_values(by=value_select)

   bun name  kor  eng bigo
0    1    a    1    2  NaN
1    2    b    2    3  재시험
2    3    c    2    3  NaN
3    4    d    3    2  NaN
4    5    e    4   20  NaN

In [15]:
# pandas에서 행의 갯수 구하기
df.shape[0] # 행

5

In [16]:
df.shape[1] # 열

5

In [17]:
len(df.index) # 행

5

In [18]:
len(df.columns) # 열

5

In [19]:
df.sort_values(by=df.shape[1]-1)

KeyError: 4